linwenjian/Quadcopter_Will/Software/SDK1_1/platform/hal/src/sim/MK63F12/fsl_sim_hal_MK63F12.c
#if FSL_FEATURE_SIM_OPT_HAS_UART0SRC
    case kClockUart0Src:                 /* UART0SRC*/
        BW_SIM_SOPT2_UART0SRC(baseAddr, setting);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_TPMSRC
    case kClockTpmSrc:                   /* TPMSRC*/
        BW_SIM_SOPT2_TPMSRC(baseAddr, setting);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_LPUARTSRC
    case kClockLpuartSrc:                /* LPUARTSRC*/
        BW_SIM_SOPT2_LPUARTSRC(baseAddr, setting);
        break;
#endif

    case kClockOsc32kSel:                /* OSC32KSEL*/
        BW_SIM_SOPT1_OSC32KSEL(baseAddr, setting);
        break;
        
#if FSL_FEATURE_SIM_OPT_HAS_PLL_FLL_SELECTION
    case kClockPllfllSel:                /* PLLFLLSEL*/
        BW_SIM_SOPT2_PLLFLLSEL(baseAddr, setting);
        break;
#endif
        
#if FSL_FEATURE_SIM_OPT_HAS_TRACE_CLKSEL
    case kClockTraceSel:                 /* TRACE_CLKSEL*/
        BW_SIM_SOPT2_TRACECLKSEL(baseAddr, setting);
        break;
#endif

    case kClockClkoutSel:                /* CLKOUTSEL*/
        BW_SIM_SOPT2_CLKOUTSEL(baseAddr, setting);
        break;

#if FSL_FEATURE_SIM_OPT_HAS_RTC_CLOCK_OUT_SELECTION
    case kClockRtcClkoutSel:                /* RTCCLKOUTSEL*/
        BW_SIM_SOPT2_RTCCLKOUTSEL(baseAddr, setting);
        break;
#endif
        
    default:
        status = kSimHalNoSuchClockSrc;
        break;
    }

    return status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_GetSource
 * Description   : Get clock source setting
 * This function will get the settings for specified clock source. Each clock 
 * source has its clock selection settings. Refer to reference manual for 
 * details of settings for each clock source. Refer to clock_source_names_t
 * for clock sources.
 * 
 *END**************************************************************************/
sim_hal_status_t CLOCK_HAL_GetSource(uint32_t baseAddr,
                                     clock_source_names_t clockSource,
                                     uint8_t *setting)
{
    sim_hal_status_t status = kSimHalSuccess;
    assert(clockSource < kClockSourceMax);

    switch (clockSource)
    {
#if FSL_FEATURE_SIM_OPT_HAS_NFCSRC
    case kClockNfcSrc:                   /* NFCSRC*/
        *setting = BR_SIM_SOPT2_NFCSRC(baseAddr);
        break;
    case kClockNfcSel:                   /* NFC_CLKSEL*/
        *setting = BR_SIM_SOPT2_NFC_CLKSEL(baseAddr);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_ESDHCSRC
    case kClockEsdhcSrc:                 /* ESDHCSRC*/
        *setting = BR_SIM_SOPT2_ESDHCSRC(baseAddr);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_SDHCSRC
    case kClockSdhcSrc:                  /* SDHCSRC*/
        *setting = BR_SIM_SOPT2_SDHCSRC(baseAddr);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_LCDCSRC
    case kClockLcdcSrc:                  /* LCDCSRC*/
        *setting = BR_SIM_SOPT2_LCDCSRC(baseAddr);
        break;
    case kClockLcdcSel:                  /* LCDC_CLKSEL*/
        *setting = BR_SIM_SOPT2_LCDC_CLKSEL(baseAddr);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_TIMESRC
    case kClockTimeSrc:                  /* TIMESRC*/
        *setting = BR_SIM_SOPT2_TIMESRC(baseAddr);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_RMIISRC
    case kClockRmiiSrc:                  /* RMIISRC*/
        *setting = BR_SIM_SOPT2_RMIISRC(baseAddr);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_USBSRC
    case kClockUsbSrc:                    /* USBSRC*/
        *setting = BR_SIM_SOPT2_USBSRC(baseAddr);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_USBFSRC
    case kClockUsbfSrc:                   /* USBFSRC*/
        *setting = BR_SIM_SOPT2_USBFSRC(baseAddr);
        break;
    case kClockUsbfSel:                  /* USBF_CLKSEL*/
        *setting = BR_SIM_SOPT2_USBF_CLKSEL(baseAddr);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_USBHSRC
    case kClockUsbhSrc:                  /* USBHSRC*/
        *setting = BR_SIM_SOPT2_USBHSRC(baseAddr);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_UART0SRC
    case kClockUart0Src:                 /* UART0SRC*/
        *setting = BR_SIM_SOPT2_UART0SRC(baseAddr);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_TPMSRC
    case kClockTpmSrc:                   /* TPMSRC*/
        *setting = BR_SIM_SOPT2_TPMSRC(baseAddr);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_LPUARTSRC
    case kClockLpuartSrc:                /* LPUARTSRC*/
        *setting = BR_SIM_SOPT2_LPUARTSRC(baseAddr);
        break;
#endif

    case kClockOsc32kSel:                /* OSC32KSEL*/
        *setting = BR_SIM_SOPT1_OSC32KSEL(baseAddr);
        break;

#if FSL_FEATURE_SIM_OPT_HAS_PLL_FLL_SELECTION
    case kClockPllfllSel:                /* PLLFLLSEL*/
        *setting = BR_SIM_SOPT2_PLLFLLSEL(baseAddr);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_TRACE_CLKSEL
    case kClockTraceSel:                 /* TRACE_CLKSEL*/
        *setting = BR_SIM_SOPT2_TRACECLKSEL(baseAddr);
        break;
#endif

    case kClockClkoutSel:                /* CLKOUTSEL */
        *setting = BR_SIM_SOPT2_CLKOUTSEL(baseAddr);
        break;

#if FSL_FEATURE_SIM_OPT_HAS_RTC_CLOCK_OUT_SELECTION
    case kClockRtcClkoutSel:                /* RTCCLKOUTSEL */
        *setting = BR_SIM_SOPT2_RTCCLKOUTSEL(baseAddr);
        break;
#endif
        
    default:
        status = kSimHalNoSuchClockSrc;
        break;
    }

    return status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_SetDivider
 * Description   : Set clock divider setting
 * This function will set the setting for specified clock divider. Refer to 
 * reference manual for supported clock divider and value range. Refer to 
 * clock_divider_names_t for dividers.
 * 
 *END**************************************************************************/
sim_hal_status_t CLOCK_HAL_SetDivider(uint32_t baseAddr,
                                      clock_divider_names_t clockDivider, 
                                      uint32_t setting)
{
    sim_hal_status_t status = kSimHalSuccess;
    assert(clockDivider < kClockDividerMax);

